Функция СведенияОВнешнейОбработке() Экспорт

	ДанныеДляРег = Новый Структура();
	ДанныеДляРег.Вставить("Наименование", "Автоматизация выставления счетов и УПД");
	ДанныеДляРег.Вставить("БезопасныйРежим", Ложь);
	ДанныеДляРег.Вставить("Версия", "1.2");
	ДанныеДляРег.Вставить("Информация", "Обработка для автоматизации выставления счетов и УПД");
	ДанныеДляРег.Вставить("Вид", "ДополнительнаяОбработка");

	ТабЗнКоманды = Новый ТаблицаЗначений;
	ТабЗнКоманды.Колонки.Добавить("Идентификатор");
	ТабЗнКоманды.Колонки.Добавить("Использование");
	ТабЗнКоманды.Колонки.Добавить("Представление");

	НовСтрока = ТабЗнКоманды.Добавить();
	НовСтрока.Идентификатор = "ОткрытьОбработку";
	НовСтрока.Использование = "ОткрытиеФормы";
	НовСтрока.Представление = "Автоматизация выставления счетов и УПД";
	ДанныеДляРег.Вставить("Команды", ТабЗнКоманды);

	Возврат ДанныеДляРег;

КонецФункции