// {{ ПрофРешение Гавриленко С.И. - Задача №00-3496 10.11.2025
// Процедура - Дополнительная обработка проверки заполнения Кадровых Документов
// Блокирует проведение (отмена проведения) документов, если в периоде, в котором эти документы изменяются, 
// по сотрудникам, которые есть в этих документа, уже есть рассчитанный (проведенный) документ "Начисление зарплаты и взносов".
// Период определяется как "ПериодРегистрации" (если он есть), иначе как дата документа (приведенная к началу месяца). 
//
// Параметры:
//  Источник			 - ДокументОбъект - Кадровый документ
//  Отказ				 - Булево 
//  ПроверяемыеРеквизиты - Массив 
//
Процедура РасшБВКД_ОбработкаПроверкиЗаполненияКД(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
		
	// Проверка на проведение "задним числом"
	Если Источник.ПериодРегистрации < НачалоМесяца(Источник.Дата) Тогда
		ОбщегоНазначения.СообщитьПользователю("Дата документа не может наступать позже указанного в документе месяца." ); // ПрофРешение Гавриленко С.И. - Задача №00-3496 13.11.2025
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
		
	// Если есть реквизит "ПериодРегистрации", то определяем по нему дату для запроса, если нет, то по дате документа
	ДатаДок = ?(ОбщегоНазначения.ЕстьРеквизитОбъекта("ПериодРегистрации", Источник.Метаданные()),
				Источник.ПериодРегистрации,
				НачалоМесяца(Источник.Дата));	
				
	// Получение списка сотрудников
	СписокСотрудников = Новый СписокЗначений;
	Если Источник.Метаданные().Реквизиты.Найти("Сотрудник") <> Неопределено Тогда
		СписокСотрудников.Добавить(Источник.Сотрудник);	
	ИначеЕсли Источник.Метаданные().ТабличныеЧасти.Найти("Сотрудники") <> Неопределено Тогда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Сотрудник", Источник.Метаданные().ТабличныеЧасти.Сотрудники) Тогда
			Для каждого СтрокаТЧ Из Источник.Сотрудники Цикл
				СписокСотрудников.Добавить(СтрокаТЧ.Сотрудник);	
			КонецЦикла;
		Иначе
			Отказ = Истина;	
		КонецЕсли;	
	Иначе 
		Отказ = Истина;	
	КонецЕсли;
	
	Если Отказ Тогда 
		// {{ ПрофРешение Гавриленко С.И. - Задача №00-3496 13.11.2025
		ОбщегоНазначения.СообщитьПользователю("Ошибка получения списка сотрудников из документа. Обратитесь к администратору системы.");
		СтруктураСобытий = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий, ДатаСобытия");
		СтруктураСобытий.ИмяСобытия    = "Блокировка ввода кадровых документов";
	    СтруктураСобытий.ПредставлениеУровня = "Ошибка"; 
		СтруктураСобытий.Комментарий    = "Невозможно получить список сотрудников из кадрового документа для блокировки его проведения";
	    СтруктураСобытий.ДатаСобытия    = ТекущаяДата();
	    СобытияДляЖурналаРегистрации = Новый СписокЗначений();
	    СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации();
		// }} ПрофРешение Гавриленко С.И. - Задача №00-3496 13.11.2025
		Возврат;	
	КонецЕсли;
	
	// Поиск документов 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетыССотрудниками.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
		|		ПО ВзаиморасчетыССотрудниками.Регистратор = НачислениеЗарплаты.Ссылка
		|ГДЕ
		|	НачислениеЗарплаты.Проведен
		|	И НачислениеЗарплаты.МесяцНачисления >= &НачалоМесяца
		|	И ВзаиморасчетыССотрудниками.Сотрудник В(&СписокСотрудников)
		|   И НЕ НачислениеЗарплаты.РежимДоначисления";
	
	Запрос.УстановитьПараметр("НачалоМесяца", ДатаДок);
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Проведение документа невозможно, уже есть рассчитанный документ 'Начисление зарплаты и взносов' "); // ПрофРешение Гавриленко С.И. - Задача №00-3496 13.11.2025
		Отказ = Истина; 
		Возврат;
	КонецЕсли;       

КонецПроцедуры 
// }} ПрофРешение Гавриленко С.И. - Задача №00-3496 10.11.2025

